# Условные операторы

Рассмотрим простую задачу, я хочу вводить цифры на компьютер и узнавать, четные они или нет.


```python
a = int(input()) #вводим нашу цифру с клавиатуры и храним ее в а
b = a % 2 #в переменной b будем хранить остаток от деления a на 2
print(b) #выведем
```

Крутяк, теперь я смогу узнать четное число или нет, в зависимости от того чему равен b, 1 если нечетное и 0 если четное. Но а если я хочу прям увидеть слово "Четное" если число четное? Для такого используют if (если)


```python
a = 2
if b == 1: #если остаток от деления а на 2 равен 1 (заметьте что в if пишется два равно)
    print("Нечетное")
if b == 0: #если остаток 0
    print("Четное") #то пишем четное
```

    Четное
    

Также с if часто используются elif (иначе если) и else (иначе), они выполняются лишь тогда, когда условие в if не выполняется, например:


```python
q = 10 
if (q - 5 < 3): #если q - 5 меньше трех то
    print("первое условие выполнилось")#распечатай q
elif (q - 5 == 3): #иначе, если верхний if не выполнился, и q - 5 равняется 3, то
    print("второе условие выполнилось")
else: #если все if и elif сверху не прошли проверку
    print("третье условие выполнилось")
if (q == 10): #это уже отдельный if, который не зависит от верхних
    print("первое отдельное условие выполнилось")
```

    третье условие выполнилось
    первое отдельное условие выполнилось
    

Так, первое условие не выполнилось, поэтому проверилось второе, а затем третье. Последнее отдельное условие от предыдущих никак не зависит и оно выполняется. Так мы можем составлять такие логические цепочки из if и else. В итоге используем если хотим чтобы код выполнялся, только если выполняется какое-то условие (заметьте как все действия внутри if происходят чуть правее, в питоне это очень важно)

Также в if есть операции равно(==), больше(>), больше равно (>=), меньше(<), меньше равно(<=)  <--- удобно для сравнивания цифр. Также существуют операции and (и),значит if выполняется тогда, когда выполянются оба условия; or (или), if выполняется если выполняется хотя бы одно из условий. Звучит как doozey но на примере будет понятнее:


```python
y = 1
v = 5
if (y > 0 and v > 3): #если y больше 0 И v больщше 3, раз оба условия правдивы то выведется 
    print("Первое условие выполняется")
if (y < 0 and v > 3): #а здесь уже первое условие y < 0 не выполняется, следовательно не будет на экран выводиться второе условие
    print("Второе условие выполняется")
if (y == v or v == 5): #здесь первое условие не выполнятся, но зато второе выполнятся, поэтому будет выводиться
    print("Третье условие выполняется")
if (y == 0 or v == 10 or v == y): #здесь не выполнятся ни одно из них
    print("Четвертое условие выполняется")
if ((y ==5 or v ==5) and (y - 1 ==0)): #если if поделен на две части, в первой скобке выражение выполняется,поскольку v = 5, и во второй скобке y - 1 = 0 тоже выполняется, нам нужно чтоб выполянлось и то и и то следовательно
    print("Пятое условие выполняется")
```

    Первое условие выполняется
    Третье условие выполняется
    Пятое условие выполняется
    

# Задачи на понимание: 
1. Ввести натуральные числа A, B и C. Если A кратно B и B больше C, то вывести A/B+C, если A кратно B и B меньше C, то вывести A/B-C, в остальных случаях вывести (A+B)*C. 
2. Даны два целых числа, каждое число записано в отдельной строке выведите наибольшее из данных чисел.
3. Напишите программу, которая считывает три числа с клавиатуры, и подсчитывает количество среди них четных чисел.

## WHILE FOR

While (пока) очень похож на if, тем что в нем тоже проверяется некое условие, и код ниже выполняется лишь при выполнении этого условия, с одним огромным отличием, код выполняется ПОКА выполняется условие


```python
u = 5
while u == 5: #пока u равно 5 
    print ("hi") #выводи слово hi
```

Такой цикл называется бесконечным, ведь его условие всегда выполняется (u всегда равняется 5) следовательно, действие будет вечно происходить (рекомендую самому ввести такой код для наглядности).


```python
u = 5
while u < 10: #пока u меньше 10 
    print ("hi") #выводи слово hi
    u = u + 1
```

    hi
    hi
    hi
    hi
    hi
    

Так получили 5 hi,сначала u = 5, программа вывела hi и прибавила к u единицу, затем опять проверила условие, меньше ли u 10, ну теперь u = 6 так что да, опять печатает hi и прибавляет 1 к u и тд. While удобен для того чтобы прописывать выполнение многих одиннаковых действий, к примеру вот программа которая выводит число на экран, только если оно счетно 


```python
x = 2 #созаддим нашу x, изначально дадим ей значение 2 чтобы оно прошло первую проверку нашего while
while x % 2 == 0: #пока x счетно
    x = int(input()) #считай x с клавиатуры 
    print(x) #и выведи его на экран
```

    2
    4
    6
    3
    

Последнее что мы тут рассмотрим, это for, его суть в том что он выполняет код определенное количество раз, в for проверки на условие нету. В for есть переменная (по дефолту равная 0), к которой добавляется 1, пока она не достигнет цифры в range, тоесть в for t in range(5), код выполнится 5 раз (компы считают с 0), сначало t =0, потом t=1 и тд. число в range можно написать самому или ввести переменную


```python
for t in range(5): 
    print(t)
```

    0
    1
    2
    3
    4
    


```python
n = 20
for s in range(n):
    print("я написал for я умный")
```

    я написал for я умный
    я написал for я умный
    я написал for я умный
    я написал for я умный
    я написал for я умный
    я написал for я умный
    я написал for я умный
    я написал for я умный
    я написал for я умный
    я написал for я умный
    я написал for я умный
    я написал for я умный
    я написал for я умный
    я написал for я умный
    я написал for я умный
    я написал for я умный
    я написал for я умный
    я написал for я умный
    я написал for я умный
    я написал for я умный
    

# Задачи на понимание:
1. Вывести на экран все четный числа от 0 до 20 включительно, через for
2. Сделать бесконечный while, который будет проверять все числа которые вы вводите на четность и нечетность
3. Вывести на экран последовательность чисел: 2,5,8,11,14..., к каждому прибавляется 3,  так вывести 100 чисел
